FamilyCategoryId Property
 The id of the category or sub category in which the elements that this family could generate reside.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId FamilyCategoryId { get; set; }
Visual Basic
Public Property FamilyCategoryId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ FamilyCategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  When setting this property: The input category id cannot be assigned as the new category for this family.
Autodesk.Revit.ExceptionsArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.ExceptionsInvalidOperationException |  When setting this property: The family is not an owner family for its own editable document.
See Also
Family Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →